[
    {
        "musclegroup_id": 1,
        "name": "Archer pull up",
        "gif": "https://v2.exercisedb.io/image/IhSIJPWFEJU76Q",
        "equipment": "Body Weight",
        "instructions": "Start by hanging from a pull-up bar with an overhand grip, slightly wider than shoulder-width apart. Engage your core and pull your shoulder blades down and back. As you pull yourself up, bend one arm and bring your elbow towards your side, while keeping the other arm straight. Continue pulling until your chin is above the bar and your bent arm is fully flexed. Lower yourself back down with control, straightening the bent arm and repeating the movement on the other side. Alternate sides with each repetition."
     },
     {
        "musclegroup_id": 1,
        "name": "Bodyweight standing row",
        "gif": "https://v2.exercisedb.io/image/lQ8dDwX3Wk9ZwF",
        "equipment": "Body Weight",
        "instructions": "Stand with your feet shoulder-width apart and knees slightly bent. Grasp a bar or handles with an overhand grip, palms facing down. Keep your back straight and core engaged. Pull the bar or handles towards your body, squeezing your shoulder blades together. Pause for a moment at the top of the movement. Slowly release and extend your arms back to the starting position. Repeat for the desired number of repetitions."
     },
     {
        "musclegroup_id": 1,
        "name": "Assisted standing pull-up",
        "gif": "https://v2.exercisedb.io/image/5sokFlo35yBy59",
        "equipment": "Leverage Machine",
        "instructions": "Adjust the machine to your desired weight and height settings. Stand facing the machine with your feet shoulder-width apart. Grasp the handles with an overhand grip, slightly wider than shoulder-width apart. Engage your lats and biceps, and pull yourself up towards the handles. Pause for a moment at the top, squeezing your back muscles. Slowly lower yourself back down to the starting position. Repeat for the desired number of repetitions."
     },
     {
        "musclegroup_id": 1,
        "name": "Barbell pullover",
        "gif": "https://v2.exercisedb.io/image/0GkxVdsyGxKevd",
        "equipment": "Barbell",
        "instructions": "Lie flat on a bench with your head at one end and your feet on the floor. Hold a barbell with a shoulder-width grip and extend your arms straight above your chest. Keeping your arms straight, lower the barbell behind your head in a controlled manner until you feel a stretch in your lats. Pause for a moment, then raise the barbell back to the starting position. Repeat for the desired number of repetitions."
     },
     {
        "musclegroup_id": 1,
        "name": "Barbell bent over row",
        "gif": "https://v2.exercisedb.io/image/wcpU2A9p19DOzg",
        "equipment": "Barbell",
        "instructions": "Stand with your feet shoulder-width apart and knees slightly bent. Bend forward at the hips while keeping your back straight and chest up. Grasp the barbell with an overhand grip, hands slightly wider than shoulder-width apart. Pull the barbell towards your lower chest by retracting your shoulder blades and squeezing your back muscles. Pause for a moment at the top, then slowly lower the barbell back to the starting position. Repeat for the desired number of repetitions."
     },
     {
        "musclegroup_id": 1,
        "name": "Cable low seated row",
        "gif": "https://v2.exercisedb.io/image/pW1uxy73qHMrai",
        "equipment": "Cable",
        "instructions": "Sit on the machine with your feet flat on the footrests and your knees slightly bent. Grasp the handles with an overhand grip, palms facing down. Keep your back straight and lean slightly forward, maintaining a slight bend in your elbows. Pull the handles towards your body, squeezing your shoulder blades together. Pause for a moment at the peak of the movement, then slowly release the handles back to the starting position. Repeat for the desired number of repetitions."
     },
     {
        "musclegroup_id": 1,
        "name": "Cable bar lateral pulldown",
        "gif": "https://v2.exercisedb.io/image/gTgzA3W6RtCgtk",
        "equipment": "Cable",
        "instructions": "Adjust the cable pulley to a high position and attach a straight bar. Sit facing the cable machine with your feet flat on the ground and your knees slightly bent. Grasp the bar with an overhand grip, slightly wider than shoulder-width apart. Lean back slightly and keep your chest up, maintaining a slight arch in your lower back. Pull the bar down towards your chest, leading with your elbows and squeezing your shoulder blades together. Pause for a moment at the bottom of the movement, then slowly return the bar to the starting position. Repeat for the desired number of repetitions."
     },
     {
        "musclegroup_id": 1,
        "name": "Cable lat pulldown full range of motion",
        "gif": "https://v2.exercisedb.io/image/RlTiXMMOm3dIoG",
        "equipment": "Cable",
        "instructions": "Sit on the lat pulldown machine with your knees positioned under the pads. Grasp the cable bar with an overhand grip, slightly wider than shoulder-width apart. Lean back slightly and keep your chest up, maintaining a slight arch in your lower back. Pull the bar down towards your upper chest, squeezing your shoulder blades together. Pause for a moment at the bottom of the movement, then slowly release the bar back to the starting position. Repeat for the desired number of repetitions."
     },
     {
        "musclegroup_id": 1,
        "name": "Cable cross-over lateral pulldown",
        "gif": "https://v2.exercisedb.io/image/CyK2D-ABpWJ2kb",
        "equipment": "Cable",
        "instructions": "Attach a cable handle to each side of a cable machine at shoulder height. Stand in the middle of the machine with your feet shoulder-width apart. Grasp the handles with an overhand grip and step back to create tension in the cables. Lean forward slightly from the hips, keeping your back straight and your chest up. Pull the handles down and across your body, squeezing your shoulder blades together. Pause for a moment at the bottom of the movement, then slowly return to the starting position. Repeat for the desired number of repetitions."
     },
     {
        "musclegroup_id": 1,
        "name": "Cable pulldown",
        "gif": "https://v2.exercisedb.io/image/wgBkhQGLlPRKiF",
        "equipment": "Cable",
        "instructions": "Adjust the cable pulldown machine so that the seat is at a comfortable height and the knee pad is secured. Sit on the seat with your back straight and your feet flat on the ground. Grasp the cable bar with an overhand grip, slightly wider than shoulder-width apart. Lean back slightly and engage your core. Pull the cable bar down towards your chest, squeezing your shoulder blades together. Pause for a moment at the bottom of the movement, then slowly release the bar back to the starting position. Repeat for the desired number of repetitions."
     },

    {
        "musclegroup_id": 2,
        "name": "Jump rope",
        "gif": "https://v2.exercisedb.io/image/DWrGCLFB3Rx3Z0",
        "equipment": "Rope",
        "instructions": "Hold the handles of the jump rope with your hands, palms facing inward. Stand with your feet shoulder-width apart and knees slightly bent. Swing the rope over your head and jump over it as it comes towards your feet. Land softly on the balls of your feet and repeat the jump as the rope comes around again. Continue jumping for the desired duration or number of repetitions."
     },
     {
        "musclegroup_id": 2,
        "name": "Mountain climber",
        "gif": "https://v2.exercisedb.io/image/H7mmd7lnGghwnp",
        "equipment": "Body Weight",
        "instructions": "Start in a high plank position with your hands directly under your shoulders and your body in a straight line. Engage your core and bring your right knee towards your chest, then quickly switch and bring your left knee towards your chest. Continue alternating legs in a running motion, keeping your hips low and your core engaged. Maintain a steady pace and breathe evenly throughout the exercise. Repeat for the desired number of repetitions."
     },
     {
        "musclegroup_id": 2,
        "name": "Run",
        "gif": "https://v2.exercisedb.io/image/ZkB6u6zPkWsAeS",
        "equipment": "Body Weight",
        "instructions": "Start by standing upright with your feet hip-width apart. Engage your core and keep your upper body relaxed. Begin jogging in place, lifting your knees up towards your chest and landing softly on the balls of your feet. Maintain a steady pace and continue jogging for the desired duration or distance. Remember to breathe deeply and maintain good posture throughout the exercise."
     },
     {
        "musclegroup_id": 2,
        "name": "Walking high knees lunge",
        "gif": "https://v2.exercisedb.io/image/fC5H5hEb3mMXqz",
        "equipment": "Body Weight",
        "instructions": "Stand with your feet hip-width apart. Lift your right knee up towards your chest as high as you can while balancing on your left leg. Step forward with your right foot and lower your body into a lunge position, bending both knees to a 90-degree angle. Push off with your right foot and bring your left knee up towards your chest. Step forward with your left foot and lower your body into a lunge position. Continue alternating legs and lunging forward, keeping your core engaged and maintaining a steady pace. Repeat for the desired number of repetitions."
     },
     {
        "musclegroup_id": 2,
        "name": "Burpee",
        "gif": "https://v2.exercisedb.io/image/iSZnGVEWdUJpod",
        "equipment": "Body Weight",
        "instructions": "Start in a standing position with your feet shoulder-width apart.Lower your body into a squat position by bending your knees and placing your hands on the floor in front of you. Kick your feet back into a push-up position. Perform a push-up, keeping your body in a straight line. Jump your feet back into the squat position. Jump up explosively, reaching your arms overhead. Land softly and immediately lower back into a squat position to begin the next repetition."
     },
     {
        "musclegroup_id": 2,
        "name": "Skater hops",
        "gif": "https://v2.exercisedb.io/image/qdoJNCJykzqydZ",
        "equipment": "Body Weight",
        "instructions": "Stand with your feet shoulder-width apart. Bend your knees slightly and jump to the right, landing on your right foot. As you land, swing your left leg behind your right leg and tap the ground with your left toes. Immediately jump to the left, landing on your left foot. As you land, swing your right leg behind your left leg and tap the ground with your right toes. Continue alternating sides, jumping and tapping the ground with each leg. Repeat for the desired number of repetitions."
     },
     {
        "musclegroup_id": 2,
        "name": "Semi squat jump",
        "gif": "https://v2.exercisedb.io/image/GtmWT935DIOnz2",
        "equipment": "Body Weight",
        "instructions": "Stand with your feet shoulder-width apart. Bend your knees and lower your body into a squat position. Jump explosively, extending your hips and knees while swinging your arms for momentum. Land softly on the balls of your feet and immediately go into the next repetition. Repeat for the desired number of repetitions."
     },
     {
        "musclegroup_id": 2,
        "name": "Stationary bike run",
        "gif": "https://v2.exercisedb.io/image/4cZQPduHyuLczu",
        "equipment": "Stationary Bike",
        "instructions": "Adjust the seat height and position to ensure proper alignment. Place your feet on the pedals and secure them with the straps if available. Start pedaling at a comfortable pace. Maintain a steady rhythm and increase the resistance as desired. Engage your core muscles to maintain stability and proper posture. Continue pedaling for the desired duration of your workout. Gradually decrease the resistance and slow down before coming to a complete stop. Stretch your legs and cool down after the workout."
     },
     {
        "musclegroup_id": 2,
        "name": "Walking on stairmaster",
        "gif": "https://v2.exercisedb.io/image/XjFy8DpYyJB3sy",
        "equipment": "Stairmaster Machine",
        "instructions": "Adjust the stepmill machine to a comfortable level. Step onto the machine and place your hands on the handrails for support. Start walking by placing one foot on a step and then the other, alternating between legs. Maintain an upright posture and engage your core muscles. Continue walking for the desired duration or distance. Gradually increase the intensity or speed as you become more comfortable with the exercise. Remember to cool down and stretch after completing the exercise."
     },
     {
        "musclegroup_id": 2,
        "name": "Walking on elliptical",
        "gif": "https://v2.exercisedb.io/image/6WuCMA14cBdjqm",
        "equipment": "Elliptical Machine",
        "instructions": "Adjust the resistance level and incline of the elliptical machine to your desired settings. Step onto the pedals of the machine and grip the handles lightly. Begin by pushing down with your feet and pulling the handles towards your body. Continue this motion, alternating between pushing and pulling, to simulate a walking or running motion. Maintain a steady pace and keep your core engaged throughout the exercise. Continue for the desired duration of your cardio workout. Gradually decrease the intensity and speed of the machine before stepping off."
     },

    {
       "musclegroup_id": 3,
       "name": "Archer push up",
       "gif": "https://v2.exercisedb.io/image/Bi8xVYeWIyqo56",
       "equipment": "Body Weight",
       "instructions": "Start in a push-up position with your hands slightly wider than shoulder-width apart. Extend one arm straight out to the side, parallel to the ground. Lower your body by bending your elbows, keeping your back straight and core engaged. Repeat on the other side, extending the opposite arm out to the side. Continue alternating sides for the desired number of repetitions."
    },
    {
        "musclegroup_id": 3,
        "name": "Deep push up",
        "gif": "https://v2.exercisedb.io/image/MXH9vWJqEtF88q",
        "equipment": "Body Weight",
        "instructions": "Start in a high plank position with your hands slightly wider than shoulder-width apart and your body in a straight line. Lower your chest towards the ground by bending your elbows, keeping them close to your body. Push through your palms to extend your arms and return to the starting position. Repeat for the desired number of repetitions."     
     },
     {
        "musclegroup_id": 3,
        "name": "Clap push up",
        "gif": "https://v2.exercisedb.io/image/aBDfCoTue1aQ8a",
        "equipment": "Body Weight",
        "instructions": "Start in a high plank position with your hands slightly wider than shoulder-width apart. Lower your body towards the ground by bending your elbows, keeping your core engaged. Push through your palms explosively to propel your body off the ground. While in mid-air, clap your hands together before landing back in the starting position. Repeat for the desired number of repetitions."
     },
    {
        "musclegroup_id": 3,
        "name": "Barbell bench press",
        "gif": "https://v2.exercisedb.io/image/L7vyesWgDz-LKH",
        "equipment": "Barbell",
        "instructions": "Lie flat on a bench with your feet flat on the ground and your back pressed against the bench. Grasp the barbell with an overhand grip slightly wider than shoulder-width apart. Lift the barbell off the rack and hold it directly above your chest with your arms fully extended. Lower the barbell slowly towards your chest, keeping your elbows tucked in. Pause for a moment when the barbell touches your chest. Push the barbell back up to the starting position by extending your arms. Repeat for the desired number of repetitions."
     },
     {
        "musclegroup_id": 3,
        "name": "Barbell incline bench press",
        "gif": "https://v2.exercisedb.io/image/na1JRw8gvm-kvn",
        "equipment": "Barbell",
        "instructions": "Set up an incline bench at a 45-degree angle. Lie down on the bench with your feet flat on the ground. Grasp the barbell with an overhand grip, slightly wider than shoulder-width apart. Unrack the barbell and lower it slowly towards your chest, keeping your elbows at a 45-degree angle. Pause for a moment at the bottom, then push the barbell back up to the starting position. Repeat for the desired number of repetitions."
        
     },
     {
        "musclegroup_id": 3,
        "name": "Barbell decline bench press",
        "gif": "https://v2.exercisedb.io/image/ieojiob5VojQdg",
        "equipment": "Barbell",
        "instructions": "Lie on a decline bench with your feet secured and your head lower than your hips. Grasp the barbell with an overhand grip slightly wider than shoulder-width apart. Unrack the barbell and lower it slowly towards your chest, keeping your elbows tucked in. Pause for a moment at the bottom, then push the barbell back up to the starting position. Repeat for the desired number of repetitions."
     },
     {
        "musclegroup_id": 3,
        "name": "Cable standing fly",
        "gif": "https://v2.exercisedb.io/image/BLEySU-bVjuLsr",
        "equipment": "Cable",
        "instructions": "Attach the handles to the cables at chest height. Stand with your feet shoulder-width apart, facing away from the cable machine. Grasp the handles with an overhand grip, palms facing forward. Step forward slightly to create tension in the cables. Keep your core engaged and your back straight throughout the exercise. With a slight bend in your elbows, slowly bring your arms forward and together in front of your chest. Squeeze your chest muscles at the peak of the movement. Slowly reverse the movement, returning your arms to the starting position. Repeat for the desired number of repetitions."
     },
     {
        "musclegroup_id": 3,
        "name": "Cable cross-over variation",
        "gif": "https://v2.exercisedb.io/image/BOqTOA25NkSMaP",
        "equipment": "Cable",
        "instructions": "Adjust the cable pulleys to chest height. Stand in the center of the cable machine with one foot in front of the other. Grasp the handles with your palms facing down and your arms extended out to the sides. Take a step forward, keeping your arms slightly bent. With a slight bend in your elbows, bring your hands together in front of your chest. Pause for a moment, then slowly return your arms back to the starting position. Repeat for the desired number of repetitions."   
     }, 
     {
        "musclegroup_id": 3,
        "name": "Dumbbell bench press",
        "gif": "https://v2.exercisedb.io/image/qd822ykLhhuQPV",
        "equipment": "Dumbbell",
        "instructions": "Lie flat on a bench with your feet flat on the ground and your back pressed against the bench. Hold a dumbbell in each hand, with your palms facing forward and your arms extended above your chest. Lower the dumbbells slowly to the sides of your chest, keeping your elbows at a 90-degree angle. Pause for a moment, then push the dumbbells back up to the starting position, fully extending your arms. Repeat for the desired number of repetitions."
     },
     {
        "musclegroup_id": 3,
        "name": "Dumbbell fly",
        "gif": "https://v2.exercisedb.io/image/6M5F01ql5vq8QH",
        "equipment": "Dumbbell",
        "instructions": "Lie flat on a bench with a dumbbell in each hand, palms facing each other. Extend your arms straight up over your chest, with a slight bend in your elbows. Keeping a slight bend in your elbows, lower your arms out to the sides in a wide arc until you feel a stretch in your chest. Pause for a moment, then reverse the movement and bring the dumbbells back up to the starting position. Repeat for the desired number of repetitions."
     },

     {
        "musclegroup_id": 4,
        "name": "Finger curls",
        "gif": "https://v2.exercisedb.io/image/nbUG7z8cDMLLMB",
        "equipment": "Barbell",
        "instructions": "Sit on a bench with your feet flat on the ground and hold a barbell with an underhand grip, palms facing up. Rest your forearms on your thighs, allowing your wrists to hang off the edge. Slowly curl your fingers towards your palms, squeezing the barbell tightly. Hold the contraction for a moment, then slowly release your fingers back to the starting position. Repeat for the desired number of repetitions."
     },
     {
        "musclegroup_id": 4,
        "name": "Smith standing back wrist curl",
        "gif": "https://v2.exercisedb.io/image/IOvuLlktS65qeX",
        "equipment": "Smith Machine",
        "instructions": "Stand facing the smith machine with your feet shoulder-width apart. Grasp the barbell with an overhand grip, hands shoulder-width apart. Keep your back straight and your elbows close to your body. Slowly curl your wrists upwards, bringing the barbell towards your body. Pause for a moment at the top, then slowly lower the barbell back down to the starting position. Repeat for the desired number of repetitions."
     },
     {
        "musclegroup_id": 4,
        "name": "Dumbbell one arm wrist curl",
        "gif": "https://v2.exercisedb.io/image/hwm9OExvVzMfMs",
        "equipment": "Dumbbell",
        "instructions": "Sit on a bench or chair with your feet flat on the ground. Hold a dumbbell in one hand with an underhand grip, resting your forearm on your thigh. Allow your wrist to extend, letting the dumbbell roll down towards your fingers. Slowly curl your wrist back up, bringing the dumbbell towards your forearm. Repeat for the desired number of repetitions, then switch to the other hand."
     },
     {
        "musclegroup_id": 4,
        "name": "Dumbbell reverse wrist curl",
        "gif": "https://v2.exercisedb.io/image/JNuw0EVPdgOjx9",
        "equipment": "Dumbbell",
        "instructions": "Sit on a bench or chair with your feet flat on the ground. Hold a dumbbell in each hand with an overhand grip, palms facing down. Rest your forearms on your thighs, allowing your wrists to hang off the edge. Slowly curl your wrists upward, bringing the dumbbells towards your body. Pause for a moment at the top, then slowly lower the dumbbells back down to the starting position. Repeat for the desired number of repetitions."
     },
     {
        "musclegroup_id": 4,
        "name": "Kettlebell alternating hang clean",
        "gif": "https://v2.exercisedb.io/image/lsMDmDwoj9MGU9",
        "equipment": "Kettlebell",
        "instructions": "Stand with your feet shoulder-width apart, holding a kettlebell in each hand with an overhand grip. Bend your knees slightly and hinge forward at the hips, keeping your back straight and chest up. Allow the kettlebells to hang in front of your body with your arms fully extended. In one fluid motion, explosively extend your hips, shrug your shoulders, and pull the kettlebells up towards your shoulders. As the kettlebells reach shoulder height, rotate your wrists and catch the kettlebells in the rack position, with your palms facing inward and the kettlebells resting on the outside of your forearms.Lower the kettlebells back down to the starting position and repeat the movement with the opposite arm. Continue alternating arms for the desired number of repetitions."
     },

     {
        "musclegroup_id": 5,
        "name": "Barbell seated calf raise",
        "gif": "https://v2.exercisedb.io/image/KZHT7GrKau9vca",
        "equipment": "Barbell",
        "instructions": "Sit on a bench with your feet flat on the floor and a barbell resting on your thighs. Place the balls of your feet on a raised platform, such as a block or step. Position the barbell across your thighs and hold it securely with your hands. Keeping your back straight and your core engaged, lift your heels off the ground by extending your ankles. Pause for a moment at the top, then slowly lower your heels back down to the starting position. Repeat for the desired number of repetitions."
     },
     {
        "musclegroup_id": 5,
        "name": "Barbell standing calf raise",
        "gif": "https://v2.exercisedb.io/image/TmGhuLc6v1ICnl",
        "equipment": "Barbell",
        "instructions": "Stand with your feet shoulder-width apart and place a barbell across your upper back. Raise your heels off the ground as high as possible, using only your toes. Pause for a moment at the top, then slowly lower your heels back down to the starting position. Repeat for the desired number of repetitions."
     },
     {
        "musclegroup_id": 5,
        "name": "Bodyweight standing calf raise",
        "gif": "https://v2.exercisedb.io/image/s2SjBxKOq4hCOe",
        "equipment": "Body Weight",
        "instructions": "Stand with your feet shoulder-width apart, toes pointing forward. Place your hands on a wall or stable surface for balance. Slowly raise your heels off the ground, lifting your body weight onto the balls of your feet. Pause for a moment at the top, then slowly lower your heels back down to the starting position. Repeat for the desired number of repetitions."
     },
     {
        "musclegroup_id": 5,
        "name": "Calf push stretch with hands against wall",
        "gif": "https://v2.exercisedb.io/image/fNBprTJ7Bqbnph",
        "equipment": "Body Weight",
        "instructions": "Stand facing a wall with your feet hip-width apart. Place your hands against the wall at shoulder height. Step back with one foot, keeping your heel on the ground and your leg straight. Bend your front knee slightly and lean forward, feeling a stretch in your calf. Hold the stretch for 20-30 seconds. Switch legs and repeat the stretch."
     },
     {
        "musclegroup_id": 5,
        "name": "Donkey calf raise",
        "gif": "https://v2.exercisedb.io/image/dpaAvE7W3WlB4i",
        "equipment": "Body Weight",
        "instructions": "Stand with your toes on an elevated surface, such as a step or block. Place your hands on a stable support, such as a wall or railing, for balance. Raise your heels as high as possible, lifting your body weight onto the balls of your feet. Pause for a moment at the top, then slowly lower your heels back down to the starting position. Repeat for the desired number of repetitions."
     },
     {
        "musclegroup_id": 5,
        "name": "Dumbbell seated calf raise",
        "gif": "https://v2.exercisedb.io/image/BfiA8Fb2j8kKVr",
        "equipment": "Dumbbell",
        "instructions": "Sit on a bench or chair with your feet flat on the ground and a dumbbell resting on your thighs. Place the balls of your feet on a raised surface such as a step or block, with your heels hanging off the edge. Hold onto the dumbbell for stability. Raise your heels as high as possible, lifting your body weight onto the balls of your feet. Pause for a moment at the top, then slowly lower your heels back down to the starting position. Repeat for the desired number of repetitions."
     },
     {
        "musclegroup_id": 5,
        "name": "Dumbbell standing calf raise",
        "gif": "https://v2.exercisedb.io/image/vxPyOBMfjuOxcC",
        "equipment": "Dumbbell",
        "instructions": "Stand with your feet shoulder-width apart, holding a dumbbell in each hand. Raise your heels off the ground as high as possible, using your calves. Pause for a moment at the top, then slowly lower your heels back down to the starting position. Repeat for the desired number of repetitions."
     },
     {
        "musclegroup_id": 5,
        "name": "Hack calf raise",
        "gif": "https://v2.exercisedb.io/image/zbmK3FatA4casv",
        "equipment": "Sled Machine",
        "instructions": "Adjust the sled machine to a comfortable weight. Stand on the sled machine with your toes on the platform and your heels hanging off. Hold onto the handles for stability. Raise your heels as high as possible by pushing through the balls of your feet. Pause for a moment at the top, then slowly lower your heels back down to the starting position. Repeat for the desired number of repetitions."
     },
     {
        "musclegroup_id": 5,
        "name": "Smith reverse calf raises",
        "gif": "https://v2.exercisedb.io/image/jfd4-VTIcQWBjz",
        "equipment": "Smith Machine",
        "instructions": "Adjust the smith machine bar to a height just below your shoulders. Stand facing the bar with your feet hip-width apart and toes pointing forward. Place the balls of your feet on the edge of a step or platform, with your heels hanging off. Hold onto the bar for support, keeping your back straight and core engaged. Raise your heels as high as possible, lifting your body weight onto the balls of your feet. Pause for a moment at the top, then slowly lower your heels back down to the starting position. Repeat for the desired number of repetitions."
     },
     {
        "musclegroup_id": 5,
        "name": "Smith toe raise",
        "gif": "https://v2.exercisedb.io/image/NAJ42ENMhdGaKm",
        "equipment": "Smith Machine",
        "instructions": "Adjust the smith machine bar to a height that allows you to comfortably stand with your feet flat on the ground. Position yourself under the bar with your shoulders directly below it and your feet shoulder-width apart. Place the balls of your feet on a raised platform or weight plates, with your heels hanging off the edge. Grasp the bar with an overhand grip, slightly wider than shoulder-width apart. Engage your core and keep your back straight throughout the exercise. Slowly raise your heels as high as possible, lifting your body weight onto the balls of your feet. Pause for a moment at the top, then slowly lower your heels back down to the starting position. Repeat for the desired number of repetitions."
     },
     {
        "musclegroup_id": 6,
        "name": "Neck side stretch",
        "gif": "https://v2.exercisedb.io/image/k1VHATuGRF5Gvu",
        "equipment": "Body Weight",
        "instructions": "Stand or sit up straight with your shoulders relaxed. Tilt your head to one side, bringing your ear towards your shoulder. Hold the stretch for 15-30 seconds. Repeat on the other side. Perform 2-4 sets on each side."
     },
     {
        "musclegroup_id": 6,
        "name": "Side push neck stretch",
        "gif": "https://v2.exercisedb.io/image/FeLTikpD-jGaKs",
        "equipment": "Body Weight",
        "instructions": "Stand or sit up straight with your shoulders relaxed. Tilt your head to the right, bringing your right ear towards your right shoulder. Place your right hand on the left side of your head and gently apply pressure to increase the stretch. Hold the stretch for 15-30 seconds. Repeat on the other side, tilting your head to the left and applying pressure with your left hand. Repeat the stretch 2-3 times on each side."
     },
     {
         "musclegroup_id": 7,
         "name": "Barbell front raise",
         "gif": "https://v2.exercisedb.io/image/qC33CptYqvBsUp",
         "equipment": "Barbell",
         "instructions": "Stand with your feet shoulder-width apart and hold a barbell in front of your thighs with an overhand grip. Keep your arms straight and lift the barbell forward and upward until it reaches shoulder level. Pause for a moment at the top, then slowly lower the barbell back down to the starting position. Repeat for the desired number of repetitions."
      },
      {
         "musclegroup_id": 7,
         "name": "Barbell seated overhead press",
         "gif": "https://v2.exercisedb.io/image/Q7WTLIs5nIsMcW",
         "equipment": "Barbell",
         "instructions": "Sit on a bench with your back straight and feet flat on the ground. Hold the barbell with an overhand grip, slightly wider than shoulder-width apart. Lift the barbell off the rack and bring it to shoulder level, with your elbows bent and palms facing forward. Press the barbell overhead by extending your arms fully. Pause for a moment at the top, then slowly lower the barbell back to shoulder level. Repeat for the desired number of repetitions."
      },
      {
         "musclegroup_id": 7,
         "name": "Barbell rear delt raise",
         "gif": "https://v2.exercisedb.io/image/n8t4y0zmTw304u",
         "equipment": "Barbell",
         "instructions": "Stand with your feet shoulder-width apart and hold a barbell with an overhand grip, palms facing down. Bend your knees slightly and hinge forward at the hips, keeping your back straight. Raise the barbell out to the sides, keeping your arms straight, until they are parallel to the ground. Pause for a moment at the top, then slowly lower the barbell back to the starting position. Repeat for the desired number of repetitions."
      },
      {
         "musclegroup_id": 7,
         "name": "Battling ropes",
         "gif": "https://v2.exercisedb.io/image/5PJUdqUnHAqGct",
         "equipment": "Rope",
         "instructions": "Stand with your feet shoulder-width apart and knees slightly bent. Hold one end of the rope in each hand, with your palms facing each other. Raise your arms to shoulder height, keeping your elbows slightly bent. Begin making alternating waves with the ropes by rapidly raising and lowering each arm. Continue for the desired duration or number of repetitions."
      },
      {
         "musclegroup_id": 7,
         "name": "Cable lateral raise",
         "gif": "https://v2.exercisedb.io/image/EAGehV9uxfJDri",
         "equipment": "Cable",
         "instructions": "Stand with your feet shoulder-width apart and grasp the cable handles with an overhand grip. Keep your arms straight and your core engaged. Raise your arms out to the sides until they are parallel to the floor. Pause for a moment at the top, then slowly lower your arms back down to the starting position. Repeat for the desired number of repetitions."
      },
      {
         "musclegroup_id": 7,
         "name": "Cable seated rear lateral raise",
         "gif": "https://v2.exercisedb.io/image/XxJl1zC6k9odtp",
         "equipment": "Cable",
         "instructions": "Sit on a bench facing the cable machine with your feet flat on the ground. Grasp the cable handles with an overhand grip and extend your arms straight in front of you. Keeping your arms straight, slowly raise them out to the sides until they are parallel to the floor. Pause for a moment at the top, then slowly lower your arms back to the starting position. Repeat for the desired number of repetitions."
      },
      {
         "musclegroup_id": 7,
         "name": "Cable standing cross-over high reverse fly",
         "gif": "https://v2.exercisedb.io/image/44GUFrMnZcdVbW",
         "equipment": "Cable",
         "instructions": "Attach a D-handle to each side of a cable machine at shoulder height. Stand in the middle of the cable machine with your feet shoulder-width apart. Grasp the handles with an overhand grip and extend your arms out to the sides, palms facing forward. Keep a slight bend in your elbows and maintain a straight back throughout the exercise. Engage your shoulder muscles and squeeze your shoulder blades together as you pull the handles towards the front of your body. Pause for a moment at the peak of the movement, then slowly return to the starting position. Repeat for the desired number of repetitions."
      },
      {
         "musclegroup_id": 7,
         "name": "Dumbbell arnold press",
         "gif": "https://v2.exercisedb.io/image/a3jaye2BGMWNID",
         "equipment": "Dumbbell",
         "instructions": "Sit on a bench with back support and hold a dumbbell in each hand at shoulder level, palms facing your body and elbows bent. Press the dumbbells upward until your arms are fully extended and your palms are facing forward. Rotate your wrists as you lift, so that your palms are facing forward at the top of the movement. Pause for a moment at the top, then slowly lower the dumbbells back to the starting position. Repeat for the desired number of repetitions."
      },
      {
         "musclegroup_id": 7,
         "name": "Dumbbell cuban press",
         "gif": "https://v2.exercisedb.io/image/rbKyTIvgf8C30M",
         "equipment": "Dumbbell",
         "instructions": "Stand with your feet shoulder-width apart, holding a dumbbell in each hand at shoulder height with your palms facing down. Keeping your core engaged and your back straight, press the dumbbells straight up overhead until your arms are fully extended. Rotate your wrists so that your palms are facing forward. Lower the dumbbells back down to shoulder height, rotating your wrists back to the starting position. Repeat for the desired number of repetitions."
      },
      {
         "musclegroup_id": 7,
         "name": "Dumbbell full can lateral raise",
         "gif": "https://v2.exercisedb.io/image/gARFBF6H1gR1Vt",
         "equipment": "Dumbbell",
         "instructions": "Stand with your feet shoulder-width apart, holding a dumbbell in each hand with your palms facing your body. Keep your back straight and engage your core. Raise your arms out to the sides, keeping a slight bend in your elbows, until they are parallel to the ground. Pause for a moment at the top, then slowly lower your arms back down to the starting position. Repeat for the desired number of repetitions."
      },
      {
         "musclegroup_id": 8,
         "name": "Biceps pull-up",
         "gif": "https://v2.exercisedb.io/image/Lj4mYh4R2HfJao",
         "equipment": "Body Weight",
         "instructions": "Hang from a pull-up bar with your palms facing away from you and your hands shoulder-width apart. Engage your core and pull yourself up by bending your elbows, bringing your chest towards the bar. Pause at the top of the movement, then slowly lower yourself back down to the starting position. Repeat for the desired number of repetitions."
      },
      {
         "musclegroup_id": 8,
         "name": "Close-grip push-up",
         "gif": "https://v2.exercisedb.io/image/sxlmQooNnPfzZ7",
         "equipment": "Body Weight",
         "instructions": "Start in a high plank position with your hands placed close together, directly under your shoulders. Engage your core and lower your body towards the ground, keeping your elbows close to your sides. Push through your palms to extend your arms and return to the starting position. Repeat for the desired number of repetitions."
      },
      {
         "musclegroup_id": 8,
         "name": "Cable curl",
         "gif": "https://v2.exercisedb.io/image/lmekoDoYKnygNe",
         "equipment": "Cable",
         "instructions": "Stand facing the cable machine with your feet shoulder-width apart. Grasp the cable attachment with an underhand grip, palms facing up. Keep your elbows close to your sides and your upper arms stationary. Exhale and curl the cable attachment towards your shoulders, contracting your biceps. Pause for a moment at the top of the movement, squeezing your biceps. Inhale and slowly lower the cable attachment back to the starting position. Repeat for the desired number of repetitions."
      },
      {
         "musclegroup_id": 8,
         "name": "Cable kickback",
         "gif": "https://v2.exercisedb.io/image/iUS2KNa60Ldy1i",
         "equipment": "Cable",
         "instructions": "Stand facing a cable machine with your feet shoulder-width apart. Hold the cable handle with your right hand and step back to create tension in the cable. Bend your knees slightly and hinge forward at the hips, keeping your back straight. Keep your upper arm close to your body and your elbow bent at a 90-degree angle. Extend your forearm backward, straightening your arm fully. Pause for a moment, then slowly return to the starting position. Repeat for the desired number of repetitions, then switch sides."
      },
      {
         "musclegroup_id": 8,
         "name": "Cable standing pulldown (with rope)",
         "gif": "https://v2.exercisedb.io/image/m1AtrTeawWhWYo",
         "equipment": "Cable",
         "instructions": "Attach a rope to the cable machine at the highest setting. Stand facing the machine with your feet shoulder-width apart. Grasp the rope with an overhand grip, palms facing down. Keep your back straight and core engaged throughout the exercise. Pull the rope down towards your thighs, squeezing your biceps. Pause for a moment at the bottom, then slowly release the rope back up. Repeat for the desired number of repetitions."
      },
      {
         "musclegroup_id": 8,
         "name": "Dumbbell biceps curl",
         "gif": "https://v2.exercisedb.io/image/qHyVeDRr83BS3b",
         "equipment": "Dumbbell",
         "instructions": "Stand up straight with a dumbbell in each hand, palms facing forward and arms fully extended. Keeping your upper arms stationary, exhale and curl the weights while contracting your biceps. Continue to raise the weights until your biceps are fully contracted and the dumbbells are at shoulder level. Hold the contracted position for a brief pause as you squeeze your biceps. Inhale and slowly begin to lower the dumbbells back to the starting position. Repeat for the desired number of repetitions."
      },
      {
         "musclegroup_id": 8,
         "name": "Dumbbell cross body hammer curl",
         "gif": "https://v2.exercisedb.io/image/BLSzQE79pQ5czq",
         "equipment": "Dumbbell",
         "instructions": "Stand up straight with a dumbbell in each hand, palms facing your body. Keep your elbows close to your torso and your upper arms stationary. Exhale and curl the weights while contracting your biceps, bringing the dumbbells across your body towards your opposite shoulder. Continue to raise the dumbbells until your biceps are fully contracted and the dumbbells are at shoulder level. Hold the contracted position for a brief pause as you squeeze your biceps. Inhale and slowly begin to lower the dumbbells back to the starting position. Repeat for the desired number of repetitions."
      },
      {
         "musclegroup_id": 8,
         "name": "Dumbbell preacher curl",
         "gif": "https://v2.exercisedb.io/image/sioGJAoPRMmzpW",
         "equipment": "Dumbbell",
         "instructions": "Sit on a preacher curl bench with your upper arms resting on the pad and your chest against it. Hold a dumbbell in each hand with your palms facing up and your arms fully extended. Keeping your upper arms stationary, exhale and curl the weights while contracting your biceps. Continue to raise the dumbbells until your biceps are fully contracted and the dumbbells are at shoulder level. Hold the contracted position for a brief pause as you squeeze your biceps. Inhale and slowly begin to lower the dumbbells back to the starting position. Repeat for the desired number of repetitions."
      },
      {
         "musclegroup_id": 8,
         "name": "Barbell close-grip bench press",
         "gif": "https://v2.exercisedb.io/image/TM2xJmn7iPkm3Y",
         "equipment": "Barbell",
         "instructions": "Lie flat on a bench with your feet flat on the ground and your back pressed against the bench. Grasp the barbell with a close grip, slightly narrower than shoulder-width apart. Unrack the barbell and lower it slowly towards your chest, keeping your elbows close to your body. Pause for a moment when the barbell touches your chest. Push the barbell back up to the starting position, fully extending your arms. Repeat for the desired number of repetitions."
      },
      {
         "musclegroup_id": 8,
         "name": "Barbell decline close grip to skull press",
         "gif": "https://v2.exercisedb.io/image/xcKqIdnbK62mjq",
         "equipment": "Barbell",
         "instructions": "Lie on a decline bench with your head lower than your feet and hold a barbell with a close grip. Lower the barbell towards your forehead by bending your elbows, keeping your upper arms stationary. Pause for a moment, then extend your arms to press the barbell back up to the starting position. Repeat for the desired number of repetitions."
      },
      {
         "musclegroup_id": 9,
         "name": "",
         "gif": "",
         "equipment": "",
         "instructions": ""
      },
      {
         "musclegroup_id": 9,
         "name": "",
         "gif": "",
         "equipment": "",
         "instructions": ""
      },
      {
         "musclegroup_id": 9,
         "name": "",
         "gif": "",
         "equipment": "",
         "instructions": ""
      },
      {
         "musclegroup_id": 9,
         "name": "",
         "gif": "",
         "equipment": "",
         "instructions": ""
      },
      {
         "musclegroup_id": 9,
         "name": "",
         "gif": "",
         "equipment": "",
         "instructions": ""
      },
      {
         "musclegroup_id": 9,
         "name": "",
         "gif": "",
         "equipment": "",
         "instructions": ""
      },
      {
         "musclegroup_id": 9,
         "name": "",
         "gif": "",
         "equipment": "",
         "instructions": ""
      },
      {
         "musclegroup_id": 9,
         "name": "",
         "gif": "",
         "equipment": "",
         "instructions": ""
      },
      {
         "musclegroup_id": 9,
         "name": "",
         "gif": "",
         "equipment": "",
         "instructions": ""
      },
      {
         "musclegroup_id": 9,
         "name": "",
         "gif": "",
         "equipment": "",
         "instructions": ""
      }
]